C09/Nz200/Nz200_1000up/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "./setUp/rheology"

phases (concrete air);

concrete
{
    transportModel HerschelBulkley;
    rho [ 1 -3 0 0 0 0 0 ]  $rho_concrete;
    HerschelBulkleyCoeffs
    {
	nu0   [ 0 2 -1 0 0 0 0 ]  $nu0_concrete;
	tau0  [ 0 2 -2 0 0 0 0 ]  $tau0_concrete;
	k     [ 0 2 -1 0 0 0 0 ]  $k_concrete;
	n     [ 0 0  0 0 0 0 0 ]  $n_concrete;
    }
}

air
{
    transportModel  Newtonian;
    nu              1.48e-05;
    rho             1;
}

sigma            0;		// surface tension

// ************************************************************************* //
